# Написать программу, которая запрашивает имя пользователя ‘Enter your name: ’
# и выводит ‘Hello World! Hello Ivan!’. Вместо ‘Ivan’ вывести введенное значение.
print('Hello World! Hello {0}!'.format(input('Enter your name: ')))
