# Написать программу, высчитывающую площадь круга.
# Необходимые параметры запрашиваются у пользователя.
CONST_PI = 3.1415
r = float(input('Ввдите радиус: '))
print('Площадь круга равна: {0}'.format(CONST_PI*r**2))