# Написать программу, которая определяет четное число или нечетное.
# Число запрашивается у пользователя.
a = int(input('Введите a: '))
if a % 2 == 0:
    print('Четное')
else:
    print('Нечетное')
